; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=170, out_folder=./training, instance_id=5, seed=2029, goal_proportion=0.03

(define (problem blocksworld-05)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 - object)
 (:init 
    (arm-empty)
    (clear b69)
    (on b69 b23)
    (on b23 b112)
    (on-table b112)
    (clear b125)
    (on b125 b41)
    (on b41 b130)
    (on b130 b30)
    (on-table b30)
    (clear b15)
    (on b15 b89)
    (on-table b89)
    (clear b123)
    (on-table b123)
    (clear b146)
    (on b146 b107)
    (on b107 b106)
    (on b106 b44)
    (on b44 b159)
    (on b159 b115)
    (on b115 b86)
    (on-table b86)
    (clear b119)
    (on b119 b154)
    (on b154 b14)
    (on-table b14)
    (clear b35)
    (on b35 b53)
    (on-table b53)
    (clear b100)
    (on-table b100)
    (clear b72)
    (on-table b72)
    (clear b54)
    (on-table b54)
    (clear b117)
    (on b117 b122)
    (on b122 b76)
    (on b76 b129)
    (on b129 b83)
    (on b83 b116)
    (on-table b116)
    (clear b47)
    (on b47 b87)
    (on-table b87)
    (clear b52)
    (on-table b52)
    (clear b55)
    (on b55 b1)
    (on-table b1)
    (clear b56)
    (on b56 b168)
    (on b168 b3)
    (on b3 b18)
    (on b18 b34)
    (on-table b34)
    (clear b64)
    (on b64 b29)
    (on b29 b151)
    (on b151 b7)
    (on b7 b97)
    (on b97 b93)
    (on b93 b108)
    (on-table b108)
    (clear b17)
    (on b17 b16)
    (on-table b16)
    (clear b51)
    (on b51 b71)
    (on b71 b152)
    (on b152 b155)
    (on b155 b121)
    (on-table b121)
    (clear b141)
    (on b141 b91)
    (on b91 b33)
    (on-table b33)
    (clear b144)
    (on b144 b63)
    (on b63 b95)
    (on b95 b85)
    (on b85 b139)
    (on-table b139)
    (clear b114)
    (on b114 b88)
    (on b88 b99)
    (on-table b99)
    (clear b81)
    (on b81 b131)
    (on-table b131)
    (clear b162)
    (on b162 b38)
    (on b38 b140)
    (on b140 b84)
    (on b84 b165)
    (on b165 b153)
    (on b153 b163)
    (on b163 b22)
    (on b22 b11)
    (on b11 b92)
    (on b92 b49)
    (on b49 b68)
    (on b68 b133)
    (on b133 b42)
    (on b42 b32)
    (on b32 b77)
    (on b77 b67)
    (on-table b67)
    (clear b149)
    (on b149 b31)
    (on-table b31)
    (clear b166)
    (on-table b166)
    (clear b80)
    (on-table b80)
    (clear b13)
    (on b13 b24)
    (on b24 b110)
    (on b110 b37)
    (on b37 b94)
    (on b94 b147)
    (on b147 b39)
    (on b39 b25)
    (on-table b25)
    (clear b43)
    (on b43 b20)
    (on b20 b28)
    (on-table b28)
    (clear b40)
    (on b40 b113)
    (on b113 b160)
    (on-table b160)
    (clear b2)
    (on b2 b90)
    (on b90 b4)
    (on-table b4)
    (clear b157)
    (on-table b157)
    (clear b118)
    (on b118 b70)
    (on b70 b145)
    (on b145 b167)
    (on-table b167)
    (clear b148)
    (on b148 b158)
    (on b158 b21)
    (on b21 b111)
    (on b111 b79)
    (on b79 b169)
    (on-table b169)
    (clear b135)
    (on b135 b10)
    (on b10 b104)
    (on-table b104)
    (clear b59)
    (on b59 b5)
    (on-table b5)
    (clear b126)
    (on b126 b12)
    (on b12 b150)
    (on-table b150)
    (clear b61)
    (on-table b61)
    (clear b142)
    (on b142 b161)
    (on b161 b98)
    (on b98 b96)
    (on b96 b170)
    (on b170 b109)
    (on b109 b78)
    (on b78 b57)
    (on b57 b60)
    (on b60 b143)
    (on b143 b138)
    (on b138 b19)
    (on b19 b75)
    (on b75 b65)
    (on b65 b73)
    (on b73 b101)
    (on-table b101)
    (clear b27)
    (on b27 b6)
    (on b6 b62)
    (on-table b62)
    (clear b9)
    (on b9 b50)
    (on-table b50)
    (clear b48)
    (on-table b48)
    (clear b156)
    (on b156 b26)
    (on-table b26)
    (clear b132)
    (on-table b132)
    (clear b8)
    (on b8 b66)
    (on b66 b58)
    (on b58 b137)
    (on-table b137)
    (clear b128)
    (on b128 b102)
    (on b102 b120)
    (on-table b120)
    (clear b103)
    (on b103 b164)
    (on b164 b82)
    (on b82 b74)
    (on b74 b36)
    (on-table b36)
    (clear b136)
    (on b136 b134)
    (on b134 b105)
    (on b105 b45)
    (on-table b45)
    (clear b46)
    (on b46 b124)
    (on b124 b127)
    (on-table b127))
 (:goal  (and 
    (clear b5)
    (on b5 b3)
    (on b3 b1)
    (on b1 b2)
    (on b2 b4)
    (on-table b4))))

; plan
1. (unstack b55 b1)
   deleted: (on b55 b1) (clear b55) (arm-empty)
   added: (holding b55) (clear b1)
   goals met: 1 of 6
2. (putdown b55)
   deleted: (holding b55)
   added: (clear b55) (arm-empty) (on-table b55)
   goals met: 1 of 6
3. (unstack b56 b168)
   deleted: (on b56 b168) (clear b56) (arm-empty)
   added: (holding b56) (clear b168)
   goals met: 1 of 6
4. (putdown b56)
   deleted: (holding b56)
   added: (clear b56) (arm-empty) (on-table b56)
   goals met: 1 of 6
5. (unstack b168 b3)
   deleted: (on b168 b3) (clear b168) (arm-empty)
   added: (holding b168) (clear b3)
   goals met: 1 of 6
6. (putdown b168)
   deleted: (holding b168)
   added: (clear b168) (arm-empty) (on-table b168)
   goals met: 1 of 6
7. (unstack b59 b5)
   deleted: (on b59 b5) (clear b59) (arm-empty)
   added: (holding b59) (clear b5)
   goals met: 2 of 6
8. (putdown b59)
   deleted: (holding b59)
   added: (clear b59) (arm-empty) (on-table b59)
   goals met: 2 of 6
9. (unstack b2 b90)
   deleted: (on b2 b90) (clear b2) (arm-empty)
   added: (holding b2) (clear b90)
   goals met: 2 of 6
10. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 2 of 6
11. (unstack b90 b4)
   deleted: (on b90 b4) (clear b90) (arm-empty)
   added: (holding b90) (clear b4)
   goals met: 2 of 6
12. (putdown b90)
   deleted: (holding b90)
   added: (clear b90) (arm-empty) (on-table b90)
   goals met: 2 of 6
13. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 2 of 6
14. (stack b2 b4)
   deleted: (clear b4) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b4)
   goals met: 3 of 6
15. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 3 of 6
16. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 4 of 6
17. (unstack b3 b18)
   deleted: (on b3 b18) (clear b3) (arm-empty)
   added: (holding b3) (clear b18)
   goals met: 4 of 6
18. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 5 of 6
19. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 4 of 6
20. (stack b5 b3)
   deleted: (clear b3) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b3)
   goals met: 6 of 6
